{
  "ticker": "FISV",
  "valuation_date": "2026-02-02",
  "current_price": 115.00,

  "inputs": {
    "shares_outstanding": 582.1,
    "net_debt": 23604,
    "last_fcf": 5062,
    "currency": "USD",
    "units": "millions"
  },

  "historical_growth": {
    "revenue_3yr_cagr": 8.0,
    "revenue_5yr_cagr": 15.0,
    "eps_3yr_cagr": 39.3,
    "eps_5yr_cagr": 25.8,
    "equity_3yr_cagr": -4.4,
    "equity_5yr_cagr": -3.9,
    "fcf_3yr_cagr": 20.6,
    "fcf_5yr_cagr": 19.6,
    "selected_growth_rate": 8.0,
    "growth_rate_source": "revenue_3yr_cagr",
    "growth_divergence_warning": "Equity CAGR is negative due to share buybacks and First Data acquisition leverage. Using revenue CAGR as primary indicator. Note: FY2019-2024 includes First Data merger distortions. Post-merger revenue CAGR (FY2020-2024) is 8.3%. Company currently in turnaround with growth temporarily suppressed."
  },

  "assumptions": {
    "base": {
      "growth_rates": [4.0, 3.5, 5.0, 6.5, 7.0],
      "fcf_margin": 24.0,
      "wacc": 9.5,
      "terminal_growth": 3.0,
      "rationale": "Conservative case reflecting 2026 transition year guidance (low single-digit growth), modest recovery in Years 3-5 as operational improvements take hold. FCF margin stable at historical average. WACC reflects moderate risk given turnaround uncertainty but strong market position."
    },
    "bull": {
      "growth_rates": [6.0, 8.0, 10.0, 10.0, 9.0],
      "fcf_margin": 26.5,
      "wacc": 8.5,
      "terminal_growth": 3.5,
      "rationale": "Turnaround succeeds: New leadership executes, Clover hits $4.5B by Year 2, international expansion delivers, platform consolidation drives margin expansion. Returns to historical 8-10% organic growth by Year 3. Management's 2027+ double-digit EPS growth target achieved through operational leverage."
    },
    "bear": {
      "growth_rates": [2.0, 1.5, 2.5, 3.0, 3.5],
      "fcf_margin": 22.0,
      "wacc": 11.0,
      "terminal_growth": 2.5,
      "rationale": "Turnaround fails: Clover attrition continues, competitive losses accelerate in Financial Solutions, credibility never recovered. Growth structurally impaired by service delivery issues and market share erosion. Margin compression from competitive pricing pressure. High leverage constrains financial flexibility."
    }
  },

  "projections": {
    "base": {
      "years": ["Y1", "Y2", "Y3", "Y4", "Y5"],
      "revenue": [21274, 22019, 23120, 24623, 26346],
      "fcf": [5106, 5285, 5549, 5910, 6323],
      "discount_factors": [0.913, 0.834, 0.762, 0.696, 0.635],
      "pv_fcf": [4662, 4408, 4228, 4113, 4015]
    },
    "bull": {
      "years": ["Y1", "Y2", "Y3", "Y4", "Y5"],
      "revenue": [21684, 23419, 25761, 28337, 30887],
      "fcf": [5746, 6206, 6827, 7509, 8185],
      "discount_factors": [0.922, 0.850, 0.783, 0.721, 0.665],
      "pv_fcf": [5298, 5275, 5346, 5414, 5443]
    },
    "bear": {
      "years": ["Y1", "Y2", "Y3", "Y4", "Y5"],
      "revenue": [20865, 21178, 21707, 22358, 23141],
      "fcf": [4590, 4659, 4776, 4919, 5091],
      "discount_factors": [0.901, 0.812, 0.731, 0.659, 0.593],
      "pv_fcf": [4136, 3783, 3491, 3241, 3019]
    }
  },

  "valuation": {
    "base": {
      "sum_pv_fcf": 21426,
      "terminal_fcf": 6513,
      "terminal_value": 100200,
      "pv_terminal": 63627,
      "enterprise_value": 85053,
      "equity_value": 61449,
      "intrinsic_value": 105.57,
      "upside": -8.2,
      "notes": "Conservative base case suggests modest undervaluation at current price. Reflects balanced view of turnaround risks and recovery potential."
    },
    "bull": {
      "sum_pv_fcf": 26776,
      "terminal_fcf": 8472,
      "terminal_value": 169440,
      "pv_terminal": 112680,
      "enterprise_value": 139456,
      "equity_value": 115852,
      "intrinsic_value": 199.04,
      "upside": 73.1,
      "notes": "If turnaround succeeds and management delivers on growth targets, significant upside exists from current depressed levels."
    },
    "bear": {
      "sum_pv_fcf": 17670,
      "terminal_fcf": 5218,
      "terminal_value": 61388,
      "pv_terminal": 36403,
      "enterprise_value": 54073,
      "equity_value": 30469,
      "intrinsic_value": 52.35,
      "upside": -54.5,
      "notes": "If competitive losses accelerate and turnaround fails, substantial downside remains despite 70% decline from peak. Value trap scenario."
    }
  },

  "entry_price": {
    "base": {
      "terminal_value_per_share": 172.15,
      "years_to_terminal": 5,
      "entry_price": 85.59,
      "entry_discount_from_current": -25.6,
      "notes": "To achieve 15% CAGR to terminal value, would need to buy at $85.59. Current price of $115 implies lower expected returns if base case plays out."
    },
    "bull": {
      "terminal_value_per_share": 291.11,
      "years_to_terminal": 5,
      "entry_price": 144.72,
      "entry_discount_from_current": 25.8,
      "notes": "Current price provides 15% CAGR opportunity if bull case materializes. Attractive risk/reward for turnaround believers."
    },
    "bear": {
      "terminal_value_per_share": 105.47,
      "years_to_terminal": 5,
      "entry_price": 52.43,
      "entry_discount_from_current": -54.4,
      "notes": "Bear case implies significant further downside from current levels. Risk of 'value trap' if turnaround execution falters."
    }
  },

  "sensitivity": {
    "wacc_range": [7.5, 8.5, 9.5, 10.5, 11.5],
    "terminal_growth_range": [2.0, 2.5, 3.0, 3.5, 4.0],
    "matrix": [
      [147.23, 160.54, 177.42, 199.19, 228.64],
      [123.04, 132.89, 145.16, 160.54, 180.15],
      [105.57, 112.94, 121.95, 133.24, 147.66],
      [92.34, 98.15, 105.21, 113.96, 124.96],
      [81.98, 86.66, 92.23, 98.96, 107.17]
    ],
    "notes": "Base case uses WACC 9.5% (row 3) and Terminal Growth 3.0% (column 3). Sensitivity shows high valuation sensitivity to terminal growth assumptions given stable, high-margin business model."
  },

  "probability_weighted": {
    "weights": {
      "bull": 0.30,
      "base": 0.45,
      "bear": 0.25
    },
    "weighted_iv": 113.31,
    "notes": "Slightly higher probability to bull case (30%) versus bear (25%) reflects oversold sentiment and strong structural position, while base case (45%) acknowledges execution uncertainty. Weighted IV of $113.31 suggests fair value near current price with asymmetric upside if turnaround succeeds."
  },

  "commentary": {
    "investment_thesis": "Fiserv presents a classic turnaround opportunity following a 70% stock decline driven by execution missteps rather than structural business deterioration. The company retains formidable competitive advantages (99% core banking retention, 90B annual transactions, high switching costs) and operates in attractive end markets (digital payments, fintech infrastructure). New leadership team, 2026 reset year positioning, and deeply oversold sentiment create potential for significant returns IF management can execute on operational improvements and restore credibility. However, substantial risk remains given competitive losses, Clover strategy failures, high leverage (Altman Z-Score 1.41), and securities litigation overhang. This is NOT a low-risk value play but rather a turnaround speculation requiring conviction in management's ability to deliver.",

    "key_considerations": [
      "Turnaround timeline: 2026 is explicitly a 'transition year' with low single-digit growth and declining EPS. Recovery expected 2027+, requiring patience.",
      "Credibility deficit: Management dramatically missed on guidance in October 2025. Investors will demand proof of execution before re-rating the stock.",
      "Clover critical: $4.5B revenue target for 2026 is make-or-break for bull case. Current trajectory shows $200M shortfall in 2025 and 16% attrition from forced migrations.",
      "Leverage constraint: $23.6B net debt limits financial flexibility and creates vulnerability to interest rate or credit market shocks.",
      "Competitive dynamics: Losing share to FIS, Jack Henry, and cloud-native fintechs. Must prove service delivery improvements to stem client defections.",
      "Legal overhang: Securities class action lawsuit creates uncertainty and potential financial liability.",
      "Catalysts: Q4 2025 earnings (Feb 10, 2026) and planned H1 2026 investor day will be critical tests of new leadership credibility."
    ],

    "valuation_summary": "At $115, FISV trades near fair value under base case assumptions ($105.57 IV) but offers compelling 73% upside in bull scenario versus 54% downside in bear case. The asymmetric risk/reward profile favors patient, contrarian investors with high risk tolerance and conviction in the turnaround narrative. Conservative investors should wait for proof of execution (stabilizing client retention, Clover trajectory improvement, margin recovery) before establishing positions. Entry price analysis suggests optimal entry around $85-90 for 15% CAGR potential, indicating current levels are fair but not offering significant margin of safety.",

    "scenario_probabilities_rationale": "Bull case (30%): Reflects meaningful possibility that new leadership, platform consolidation, and Clover international expansion succeed. Structural advantages and oversold sentiment support higher-than-base probability. Base case (45%): Most likely outcome - modest recovery with growth normalizing to mid-single digits but without significant multiple expansion given credibility deficit. Bear case (25%): Non-trivial risk that competitive losses accelerate, Clover strategy continues to disappoint, and high leverage constrains response options."
  }
}
