{
  "ticker": "SEK.NZ",
  "company_name": "Seeka Limited",
  "analysis_date": "2026-02-03",
  "overview": "Seeka Limited is New Zealand and Australia's largest fully integrated kiwifruit supply company, providing orcharding, post-harvest packing, coolstorage, and retail services across the fresh produce industry. Headquartered in Te Puke, New Zealand, Seeka operates 12 post-harvest facilities, grows kiwifruit on approximately 1,000 hectares, and handles approximately 21% of New Zealand's kiwifruit post-harvest market, servicing Zespri (the global kiwifruit marketer) and directly supplying large-format retailers in Australia, Asia, and New Zealand.",
  "business_model": {
    "summary": "Highly seasonal fee-for-service business model with revenue concentrated in H1 (January-June harvest period). Post-harvest operations generate ~60% of revenue through per-tray packing and coolstorage fees. Orcharding provides ~25% of revenue through orchard management fees and profit-sharing on leased orchards. Model benefits from operational leverage as volumes increase.",
    "revenue_streams": [
      {"name": "Post-harvest (packing & coolstorage)", "percent": 60, "trend": "stable"},
      {"name": "Orcharding (management & leased orchards)", "percent": 25, "trend": "growing"},
      {"name": "SeekaFresh retail services", "percent": 8, "trend": "growing"},
      {"name": "Australia operations", "percent": 5, "trend": "growing"},
      {"name": "Other (avocado oil, Kiwi Crush)", "percent": 2, "trend": "stable"}
    ],
    "customer_type": "B2B - primarily Zespri (the single-desk kiwifruit exporter), independent growers, and retail customers",
    "geographic_mix": "New Zealand 95%, Australia 5%",
    "seasonality": "Highly seasonal - majority of earnings generated in H1 (January-June kiwifruit harvest and packing period)"
  },
  "competitive_position": {
    "main_competitors": ["EastPack (cooperative, ~30% market share)", "DMS Progrowers Limited", "Apata Group Limited", "Mount Pack and Cool", "Aongatete Coolstores Limited"],
    "market_position": "Second-largest post-harvest operator in New Zealand with ~21% market share. Largest fully integrated player (growing + packing + marketing). Only listed pure-play kiwifruit company on NZX.",
    "moat_factors": [
      {"factor": "Long-term grower relationships", "strength": "moderate", "description": "40% of packed fruit comes from Seeka-managed or leased orchards, providing supply certainty and cross-selling opportunities. Services ~2,800 growers with multi-year contracts."},
      {"factor": "Strategic infrastructure", "strength": "moderate", "description": "12 post-harvest facilities in key growing regions with capacity for >50M trays, automated packing lines provide efficiency advantages. $388.3M in PP&E creates high barriers to entry."},
      {"factor": "Switching costs", "strength": "moderate", "description": "Growers face costs and disruption switching packhouses; multi-year contracts common. Harvest timing coordination and integrated services create stickiness."},
      {"factor": "Operational expertise", "strength": "moderate", "description": "Excellence in harvest timing, quality control, and automation delivers grower value. Low onshore fruit loss and excellent offshore quality record supports premium positioning."}
    ],
    "weaknesses": [
      "Dependence on Zespri's global marketing success and kiwifruit industry health",
      "Limited pricing power - competitive post-harvest sector with transparent fee structures",
      "High fixed costs create earnings volatility in low-volume years",
      "Market capitalization below net asset value signals investor concerns about asset utilization or earnings quality",
      "Automation lag versus best-in-class competitors like Mount Pack & Cool (600k fruit/hour processing)"
    ]
  },
  "growth_drivers": [
    "New Zealand kiwifruit industry volume growth - Zespri forecasts 10% volume increase to 236M trays by 2030 from 214M in 2025",
    "SunGold variety expansion - higher-margin gold kiwifruit projected to grow 17% to 163.5M trays by 2030, with additional 400 hectares of license releasing in 2026",
    "Automation investments - new Reemoon technology at Kerikeri and Huka Pak for 2026 season will lower unit costs and increase throughput. Cost per tray already down 19% in FY2024.",
    "Australian orchard expansion - $17.2M invested in new developments including 64 hectares of kiwifruit plus new varieties (nashi, jujube) entering production from 2026. Kiwifruit production up 166% in FY2024.",
    "Diversification beyond kiwifruit - growing revenue from persimmon (1.5M kg), citrus (14.0M kg), banana ripening, avocado (1,780 tonnes), and wholesale markets improves asset utilization",
    "Long-term orchard development partnerships - 70 hectares with iwi and Kanoa in Raukokore region entering production. $7.1M invested in 15 ha kiwifruit and 13 ha avocado on long-term leases.",
    "Market share consolidation - history of successful acquisitions (OPAC, Aongatete, Orangewood, NZ Fruits). Industry consolidating from ~39 packing facilities as capital requirements increase."
  ],
  "risks": {
    "business": [
      {"risk": "Volume volatility", "severity": "high", "description": "FY2023 saw 29.8M trays (down from 42M in FY2022) due to poor weather, causing $21M loss. FY2024 43.0M trays generated $29.7M profit. High operating leverage magnifies impact of volume swings from weather, cyclones, disease, or water stress."},
      {"risk": "Zespri dependency", "severity": "high", "description": "~60% of revenue dependent on Zespri as single-desk exporter. Zespri's market challenges, regulatory changes, or pool allocation decisions directly impact Seeka. Limited ability to diversify away from this structural dependency."},
      {"risk": "Grower concentration", "severity": "moderate", "description": "While 60% of fruit comes from independent growers, loss of large growers or orchards could impact volumes and facility utilization. Key Bay of Plenty region provides 85% of Seeka's kiwifruit."},
      {"risk": "Competitive pressure", "severity": "moderate", "description": "Unregulated post-harvest sector with major competitor EastPack (cooperative, 30% share) and Mount Pack & Cool (superior automation) constrains pricing power and margins."}
    ],
    "financial": [
      {"risk": "Debt levels and covenants", "severity": "moderate", "description": "Net debt of $130.6M (June 2025, down from $170.9M) with leverage ratio 1.57:1. Finance expenses $17.1M in FY2024. Past covenant pressures limited dividends. Reduced but still material relative to $266M net assets."},
      {"risk": "Interest rate exposure", "severity": "moderate", "description": "$140M net debt means rate movements materially impact finance costs. Benefiting from falling NZ OCR from 2024 peaks but remains exposed to potential rate increases."},
      {"risk": "Working capital intensity", "severity": "moderate", "description": "Seasonal business requires significant working capital in H1 for labor and harvest operations. Credit facility headroom critical - improved to $61.1M from $23.2M but still needs monitoring."}
    ],
    "regulatory": [
      {"risk": "Zespri export monopoly changes", "severity": "moderate", "description": "Any regulatory changes to Zespri's single-desk export model could disrupt industry structure, grower-packer relationships, and coordination efficiencies. Currently has strong industry and government support."},
      {"risk": "Labor regulations and RSE scheme", "severity": "moderate", "description": "Employs 1,200+ RSE workers from Pacific islands. Changes to Accredited Employer Work Visa scheme or immigration policy could impact labor availability and costs. Industry projected to need 28,397 seasonal workers by 2031."},
      {"risk": "Environmental regulations", "severity": "low-to-moderate", "description": "Emissions at 26,682 tonnes CO2e in FY2024 (up from 17,987 in FY2023). Increasing focus on refrigerants (Category 1 emissions), electricity use, water management. Future carbon pricing or emission mandates could increase costs."}
    ],
    "macro": [
      {"risk": "Climate change and weather", "severity": "high", "description": "Research shows Te Puke (core region) kiwifruit production may become marginal by 2050 and non-viable by 2100. Near-term risks: inadequate winter chill, spring frost, water stress, wind damage, cyclones. FY2023 saw up to 38% yield losses in some regions from Cyclone Gabrielle impacts."},
      {"risk": "PSA disease", "severity": "high", "description": "Bacterial canker (Psa-V) infected 40% of NZ orchards by 2013-14. Disease remains endemic requiring ongoing management. Climate change creates favorable conditions for pathogen proliferation. New strains or mutations could cause production losses. Australian operations particularly exposed - new crop protection program implemented but vigilance required."},
      {"risk": "NZD/USD and NZD/AUD volatility", "severity": "low-to-moderate", "description": "Natural hedge through revenue linkage to export prices (grower returns benefit from weak NZD). Australian operations have AUD exposure. Overall currency impact relatively minor but can affect relative competitiveness."},
      {"risk": "China IP theft via Zespri", "severity": "low-to-moderate", "description": "Zespri facing 7,850+ hectares of unauthorized SunGold plantings in China (up from 5,400 in 2021). Dilutes variety premium and market positioning. Recent legal victories (Wuhan court ruling 2025) may help but enforcement remains challenging. Indirect exposure through Zespri."}
    ],
    "execution": [
      {"risk": "Automation integration", "severity": "moderate", "description": "Significant capex in Reemoon technology for Kerikeri and Huka Pak for 2026 season. Integration risk and need to achieve ROI through labor savings and throughput gains. KKP line in 2nd year showing improvements but competitors like Mount Pack & Cool have more advanced systems."},
      {"risk": "Asset utilization and sale-leaseback", "severity": "moderate", "description": "Turanga Whetu accommodation facility marketed for sale-leaseback with offers below expectations. Signals potential overinvestment or market valuation concerns about Seeka's property portfolio."},
      {"risk": "Market cap discount to NAV", "severity": "moderate", "description": "Market capitalization below net asset value ($266M) despite record earnings signals investor skepticism about earnings sustainability, asset values, or future volume volatility. Goodwill of $20.2M may face impairment risk."},
      {"risk": "Management and Board transition", "severity": "low", "description": "Fred Hutchings retiring at April 2025 AGM after 12 years. Ashley Waugh resigned Dec 2024. Two new directors appointed (Mark Dewdney, Hayley Gourley). Board continuity during transition important though CEO Michael Franks provides operational continuity."}
    ]
  },
  "macro_factors": {
    "industry_outlook": "New Zealand kiwifruit industry targeting 10% volume growth by 2030 (214M to 236M trays). SunGold leading growth (+17%), Green declining (-14%). Zespri forecasting record 2025/26 season with 205-215M trays and strong per-tray returns. Global demand strong in Europe and North America. Competitive pressure from unauthorized Chinese production (7,850+ ha unauthorized SunGold) and emerging producers. Industry consolidating with increasing automation and capital requirements.",
    "cyclicality": "Highly seasonal within year (H1 heavy) but less cyclical year-to-year than most agriculture. Kiwifruit is counter-seasonal export to Northern Hemisphere, providing some demand stability. Volume swings from weather create multi-year cycles. Operational leverage magnifies both upturns and downturns (FY2023 loss vs FY2024 record profit demonstrates binary nature).",
    "interest_rate_sensitivity": "Moderate-high. $130.6M net debt (June 2025) means rate movements materially impact finance costs ($17.1M in FY2024). Falling NZ OCR from 5.5% to current lower levels is tailwind. Debt reduction focus mitigates sensitivity over time. Cash flow generation of $66.0M in FY2024 supports debt servicing.",
    "key_input_costs": ["Labor (largest cost - seasonal workers, RSE scheme, projected 28,397 workers needed by 2031)", "Electricity (coolstorage - major expenditure, subject to NZ electricity market volatility)", "Packaging materials (cartons, trays, labels - inflation pressure noted by management)", "Refrigerants and coolstore maintenance (environmental compliance considerations)", "Fuel (harvest logistics and transportation)"]
  },
  "recent_developments": [
    {"date": "2025-Aug", "event": "Upgraded FY2025 guidance to $44-48M NPBT (from $35-39M initial guidance). Announced $0.15 dividend payable October 2025, bringing total H1 2025 dividends to $0.30/share."},
    {"date": "2025-H1", "event": "Record H1 result: NPAT $37.8M (up 121% YoY), NPBT $59.4M, revenue $307.9M. Packed 47.1M trays vs 43.0M prior year. Net debt reduced $40.2M to $130.6M. Leverage ratio improved to 1.57:1."},
    {"date": "2025-H1", "event": "Announced Reemoon automation upgrades for Kerikeri and Huka Pak facilities for 2026 season to increase capacity and efficiency. Kerikeri facility will be most advanced in Seeka's portfolio."},
    {"date": "2025-H1", "event": "Acquired Olivado assets, resetting SeekaFresh's avocado oil business with local processing capacity in Northland. Minor transaction but provides value-added product capability."},
    {"date": "2025-Jan", "event": "Launched Ruby Roo (new red nashi variety) in Australian market, developed by Plant & Food Research in collaboration with Prevar. Grown on Seeka's Australian orchards."},
    {"date": "2025-Jan", "event": "Zespri's first 2025 charter to China carried 1.2M trays (5,400 tonnes) of SunGold plus 16 containers of RubyRed. Legal victory in Wuhan court against unauthorized G3 production (200+ hectares in Hubei Province)."},
    {"date": "2024-Dec", "event": "Board changes: Mark Dewdney appointed Dec 1, Hayley Gourley appointed Jan 1, Ashley Waugh resigned Dec 31. Fred Hutchings to retire at April 2025 AGM after 12 years as Chair."},
    {"date": "2024-FY", "event": "Record FY2024 results: NPBT $29.7M (vs $21M loss FY2023), packed 43.0M trays (up 44%). Resumed dividends with $0.15/share total ($0.10 Jan 2025 + $0.05 Apr 2025). Net debt reduced $35.1M to $137.3M."},
    {"date": "2024-FY", "event": "Australian operations revenue up 85% to $19.2M with kiwifruit production up 166% to 2.3M kg following new Psa crop protection program. $17.2M invested in 64 ha new kiwifruit plus pear and jujube expansion."},
    {"date": "2024-FY", "event": "Captive insurance structure (Seeka Risk Management Ltd) delivered significant cost savings on material damage and business interruption insurance, avoiding inflationary increases."},
    {"date": "2024-FY", "event": "Labor supply normalization - first time in five years all post-harvest shifts fully staffed across all regions, supporting operational excellence and timely harvest."}
  ],
  "guidance": {
    "as_of": "H1 2025 Results (August 2025) - Updated Guidance",
    "fiscal_year": "FY2025 (year ending December 2025)",
    "items": [
      {
        "metric": "Net Profit Before Tax",
        "target": "$44.0-48.0M",
        "period": "FY2025",
        "vs_prior": "raised from $35-39M (initial August guidance) and $33-37M (earlier guidance)",
        "notes": "Strong H1 result ($59.4M NPBT for 6 months) supports increased full-year guidance. Significantly above FY2024's $29.7M. Upgraded guidance reflects higher volumes and operational excellence."
      },
      {
        "metric": "NZ Kiwifruit Volumes",
        "target": "~47-50M trays (implied from H1 results)",
        "period": "FY2025",
        "vs_prior": "increased vs FY2024's 43.0M trays",
        "notes": "H1 2025 packed 47.1M trays (up 10% vs H1 2024's 43.0M). Full year depends on H2 orcharding/export activity but volumes trending positive. Capacity exists for >50M trays."
      },
      {
        "metric": "Net Bank Debt",
        "target": "Further reduction expected",
        "period": "FY2025",
        "vs_prior": "improved significantly",
        "notes": "Net debt $130.6M at June 2025 (down $40.2M YoY from $170.9M). Additional $64.8M banked in July 2025, suggesting continued strong deleveraging focus and cash generation."
      },
      {
        "metric": "Dividend",
        "target": "$0.15 per share (October 2025 payment announced)",
        "period": "H1 2025",
        "vs_prior": "maintained strong payout",
        "notes": "Total H1 2025 dividends of $0.30/share ($0.10 Jan + $0.05 Apr + $0.15 Oct) vs $0.15 total for full FY2024. Fully imputed, dividend reinvestment plan applies with 2% discount to VWAP."
      },
      {
        "metric": "2026 Crop Outlook",
        "target": "Good winter chill, positive early indicators",
        "period": "2026 season",
        "vs_prior": "better than same point last year",
        "notes": "Management noted 2025 winter chill in most regions better than prior year, lifting probability of good 2026 kiwifruit season. Too early for specific volume forecast but early indicators positive."
      },
      {
        "metric": "Zespri Industry Forecast",
        "target": "205-215M trays for 2025/26 season",
        "period": "2025/26 season",
        "vs_prior": "record levels",
        "notes": "Zespri forecasting record season with strong per-tray returns for all fruit groups (Green, SunGold, Organic, RubyRed). Additional 400 hectares SunGold license releasing in 2026. Long-term target of 236M trays by 2030."
      }
    ],
    "management_commentary": "Management stated strong interim result reflects higher volumes and successful execution of strategy to lift performance. Expect FY2025 NPBT of $44-48M (raised from $35-39M). Seeka operates in seasonal industry with significant H1 earnings weighting (~70-80% of annual profit). 2026 crop early indicators positive with better winter chill than same point 2024, though too early for reliable prediction. Focus remains on gradual debt reduction, operational excellence, and automation investments to drive efficiency gains. New Reemoon technology at Kerikeri and Huka Pak will deliver step change in capacity and unit economics for 2026 season."
  },
  "bull_case": [
    "Industry tailwind: NZ kiwifruit volumes forecast to grow 10% by 2030 (214M to 236M trays), with Zespri projecting record 2025/26 season of 205-215M trays. Seeka positioned to capture proportional growth given ~21% market share and capacity for >50M trays without major capex.",
    "Operating leverage: Record H1 2025 ($59.4M NPBT in 6 months, implying ~$80M+ annual run rate) demonstrates earnings power at higher volumes. NPBT margin expanded to 19.3% in H1 2025 vs 15.8% in H1 2024. Automation investments driving cost per tray down 19% in FY2024, with further gains expected from 2026 Reemoon technology.",
    "Financial turnaround complete: Successfully navigated 2023 crisis ($21M loss), restored profitability, reduced net debt by $75M+ over two years (from $172.4M to $130.6M, with additional $64.8M reduction in July 2025), resumed dividends ($0.30/share in H1 2025 vs $0.15 for full FY2024). Leverage ratio 1.57:1 with banking covenants comfortable.",
    "Valuation discount to fundamentals: Trading below net asset value ($266M) and analyst consensus appears stale. Stock up 67.88% over past year but normalized earnings of $44-48M NPBT (FY2025 guidance) supports significantly higher valuation. Dividend yield of 4.3%+ attractive. Resumption of capital returns signals confidence.",
    "Australian growth engine: $17.2M invested in 64 hectares new developments. Kiwifruit production up 166% in FY2024 with validated Psa crop protection program. Warakirri partnership opens significant development pipeline. Australia provides counter-seasonal production and geographic diversification. Dominant 70% share of Australian kiwifruit market.",
    "Automation competitive advantage: Reemoon technology at Kerikeri and Huka Pak will be most advanced packlines in portfolio, driving throughput gains and labor cost savings vs competitors. Industry-wide labor shortages (28,397 workers needed by 2031) favor automated operators. KKP line showing incremental improvements in 2nd season validates strategy."
  ],
  "bear_case": [
    "Binary volume-driven outcomes: FY2023 low volumes ($21M loss) vs FY2024 recovery ($30M profit) vs H1 2025 ($59M NPBT) shows extreme earnings sensitivity to weather. Climate change threatens long-term viability - research indicates Te Puke production may become marginal by 2050, non-viable by 2100. Near-term risks include inadequate winter chill, PSA disease, cyclones (Gabrielle 2023), water stress.",
    "Structural Zespri dependency: ~60% of business tied to single customer with no ability to diversify away. Zespri faces 7,850+ hectares of unauthorized SunGold in China (up 45% from 2021) diluting variety premiums. Any changes to single-desk export model, pool allocation, or Zespri's market success directly impacts Seeka with limited negotiating leverage.",
    "Market skepticism justified: Trading below book value despite record earnings suggests market sees earnings as cyclical peak or asset values as overstated. Goodwill of $20.2M may face impairment. Turanga Whetu sale-leaseback offers below expectations signals possible overinvestment in property. Market cap discount persistent even after 67.88% stock price gain.",
    "Automation execution risk: Significant capex in Reemoon technology requires successful integration and ROI achievement. Competitors like Mount Pack & Cool have superior automation (600k fruit/hour vs Seeka's distributed capacity). Technology integration challenges, downtime, or underperformance could hurt returns. KKP line took multiple seasons to optimize.",
    "Debt overhang constrains flexibility: Despite improvement, $130.6M net debt (49% of net assets) limits ability to fund growth, weather downturns, or pursue M&A. $17.1M annual finance expenses consume 35-57% of normalized NPBT ($30-48M range). Australian expansion ($17.2M) and automation capex compete with debt reduction. Banking headroom improved but still needs monitoring.",
    "Climate and biosecurity existential threats: PSA-V required costly industry restructuring. New disease strain could devastate production. Increasing cyclone frequency and water stress from climate change threaten core Te Puke region (85% of supply). Research shows long-term production becoming non-viable. Insurance costs rising while coverage tightening. One major event (like Gabrielle 2023) can erase multiple years of profits."
  ]
}
