{
  "ticker": "SPK.NZ",
  "company_name": "Spark New Zealand Limited",
  "analysis_date": "2026-02-03",
  "overview": "Spark New Zealand is New Zealand's largest telecommunications company, providing mobile, broadband, cloud, digital services, and data centre infrastructure to consumers, SMEs, and enterprise/government customers across New Zealand. The company operates New Zealand's most reliable mobile network with 42% market share, serving 2.6 million mobile connections and 660,000 broadband connections, and is refocusing on its core connectivity business following a challenging FY25.",
  "business_model": {
    "summary": "Connectivity-focused revenue model with mobile (40% of revenue) and broadband driving 80% of gross margins, complemented by IT services, cloud solutions, and a growing data centre business that was 75% divested to Pacific Equity Partners in August 2025.",
    "revenue_streams": [
      {"name": "Mobile", "percent": 40, "trend": "declining"},
      {"name": "Other connectivity (broadband, managed networks, collaboration, IoT, voice)", "percent": 25, "trend": "mixed"},
      {"name": "Cloud and IT services", "percent": 15, "trend": "declining"},
      {"name": "Procurement and partners", "percent": 15, "trend": "stable"},
      {"name": "Data centres", "percent": 5, "trend": "growing"}
    ],
    "customer_type": "B2C (consumer, SME) and B2B (enterprise, government)",
    "geographic_mix": "100% New Zealand domestic market"
  },
  "competitive_position": {
    "main_competitors": ["One NZ (formerly Vodafone NZ)", "2degrees", "MVNOs"],
    "market_position": "#1 in mobile with 42% market share, #1 in broadband, market leader in enterprise/government",
    "moat_factors": [
      {"factor": "Network quality and coverage", "strength": "strong", "description": "Named most reliable mobile network with widest coverage by Opensignal (Sept 2024), 99% 4G coverage, 50%+ 5G population coverage"},
      {"factor": "Scale advantages", "strength": "strong", "description": "Largest player with significant infrastructure investment (2,262 mobile sites), enabling better unit economics"},
      {"factor": "Brand trust", "strength": "moderate", "description": "Most trusted brand in NZ telco sector (TRA Brand Monitor)"},
      {"factor": "Incumbent position", "strength": "moderate", "description": "Largest customer base creates switching costs and data advantages"}
    ],
    "weaknesses": [
      "Small domestic market limits growth opportunities",
      "Market saturation in core mobile and broadband",
      "Significant organizational disruption from restructuring (1,300 FTE reduction)",
      "Enterprise/Government segment facing structural headwinds from workforce reductions"
    ]
  },
  "growth_drivers": [
    "5G network expansion and monetization (now covering 50% of population)",
    "IoT business growing rapidly (2.37M+ devices, up 16% connections YoY)",
    "Data centre capacity expansion (22MW operational, 118MW+ development pipeline) with PEP partnership providing funding",
    "AI and automation driving operational efficiency and new service offerings",
    "Cost reduction program delivering $110-140M annualised savings by FY27",
    "Economic recovery in NZ expected to improve enterprise spending and consumer demand"
  ],
  "risks": {
    "business": [
      {"risk": "Mobile market saturation and intense price competition", "severity": "high", "description": "Pay monthly ARPU down 0.6% in FY25, prepaid connections declined 5.2%, aggressive pricing in enterprise segment driving 13.9% ARPU decline"},
      {"risk": "Enterprise and Government revenue decline", "severity": "high", "description": "IT services down 7.7%, managed networks down 9.9%, workforce reductions reducing mobile fleet demand"},
      {"risk": "Technology transition execution risk", "severity": "moderate", "description": "New partnership model with Nokia, Infosys, HPE, Microsoft introduces operational dependencies and integration challenges"},
      {"risk": "Customer concentration in small NZ market", "severity": "moderate", "description": "Limited geographic diversification, exposed to NZ-specific economic cycles"}
    ],
    "financial": [
      {"risk": "Declining profitability", "severity": "high", "description": "Adjusted EBITDAI down 8.9% to $1,060M, adjusted NPAT down 33.6% to $227M in FY25"},
      {"risk": "Leverage concerns", "severity": "moderate", "description": "Net debt to EBITDAI at 2.3x as of Dec 2024, though improving with asset sales"},
      {"risk": "Dividend sustainability", "severity": "moderate", "description": "New policy ties dividend to FCF (70-100% payout), FCF guidance of $290-330M for FY26 lower than historical levels"}
    ],
    "regulatory": [
      {"risk": "Telecommunications sector regulatory review", "severity": "moderate", "description": "NZ government commenced 6-9 month regulatory review in June 2025 examining if current regime remains fit for purpose"},
      {"risk": "Fibre regulation changes", "severity": "moderate", "description": "Commerce Commission reviewing Fibre Input Methodologies including cost of capital and investment rules"},
      {"risk": "Network sharing obligations", "severity": "low", "description": "Ongoing regulatory requirements for wholesale access and emergency services"}
    ],
    "macro": [
      {"risk": "NZ economic weakness", "severity": "high", "description": "Economy contracted in 2024, unemployment expected to peak at 5.5% in Dec 2025/Mar 2026, weak business investment"},
      {"risk": "Interest rate sensitivity", "severity": "moderate", "description": "Consumer spending pressures from high rates (though RBNZ cutting aggressively to 2.25% by Nov 2025)"},
      {"risk": "Inflation in supplier costs", "severity": "moderate", "description": "Network equipment, energy costs, and vendor price increases pressuring margins"}
    ],
    "execution": [
      {"risk": "Organizational capability loss", "severity": "high", "description": "1,300 FTE reduction (24% workforce cut), employee engagement dropped from 67% to 50%, risk of talent loss and execution gaps"},
      {"risk": "Technology partner dependency", "severity": "moderate", "description": "Outsourcing network operations to Nokia and IT to Infosys/HPE creates dependency risks and potential service quality issues"},
      {"risk": "Cultural disruption", "severity": "moderate", "description": "Massive change program impacting morale, integration of offshore delivery models"}
    ]
  },
  "macro_factors": {
    "industry_outlook": "NZ telecom market mature with limited growth (1.2% mobile market growth in FY25), but stabilizing in H2. Total telecom revenue expected to grow at 1.6% CAGR 2024-2029 driven by mobile data and fixed broadband. Data centre demand accelerating due to cloud adoption and AI.",
    "cyclicality": "Moderate - Consumer segment relatively defensive but enterprise/government highly sensitive to economic conditions and business investment cycles",
    "interest_rate_sensitivity": "Moderate direct (through consumer spending and business investment), but improving as RBNZ cut OCR from peak 5.5% to 2.25% by Nov 2025 with further cuts expected",
    "key_input_costs": ["Network equipment (Nokia, Ericsson)", "Energy (electricity for network and data centres)", "Property/tower rentals", "International capacity and transit", "Labor costs"]
  },
  "recent_developments": [
    {"date": "2025-Aug", "event": "Announced sale of 75% of data centre business to Pacific Equity Partners for up to NZ$705M, retaining 25% stake. Transaction valued business at 30.8x FY25 EBITDA."},
    {"date": "2025-Aug", "event": "Launched new SPK-30 five-year strategy refocusing on core connectivity, moving away from broader digital services ambition"},
    {"date": "2025-Aug", "event": "Announced revised Capital Management Framework with dividend tied to free cash flow (70-100% payout), FY26 dividend guidance at 100% of FCF"},
    {"date": "2025-Jul", "event": "Completed sale of 10% HTAL stake for NZ$47M"},
    {"date": "2025-Q3", "event": "Completed sale of remaining 17% Connexa (tower company) stake to CDPQ for NZ$309M net"},
    {"date": "2025-Feb", "event": "Reduced workforce by ~1,300 FTE as part of transformation program"},
    {"date": "2025-Jan", "event": "Partnered with Genesis Energy on 10-year renewable energy deal via Lauriston Solar Farm"},
    {"date": "2024-Dec", "event": "Moved Auckland HQ to 50 Albert Street (6-Green Star rated)"},
    {"date": "2024-Q4", "event": "Mobile market share stabilized in Q4 FY25 after earlier declines"},
    {"date": "2024-Q4", "event": "Announced strategic partnerships with Nokia (network), Infosys (IT), HPE (IT infrastructure), Microsoft (cloud)"}
  ],
  "guidance": {
    "as_of": "FY25 Results - August 2025",
    "fiscal_year": "FY2026 (ending June 30, 2026)",
    "items": [
      {
        "metric": "Free Cash Flow",
        "target": "$290-330M",
        "period": "FY2026",
        "vs_prior": "new metric definition",
        "notes": "New FCF definition includes working capital changes and core business capex. Excludes spectrum and strategic investments (e.g., data centres). FY25 FCF was $330M on comparable basis."
      },
      {
        "metric": "Dividend payout ratio",
        "target": "100% of FCF",
        "period": "FY2026",
        "vs_prior": "new policy",
        "notes": "Changed from prior fixed cents per share approach. New policy targets 70-100% of FCF to provide flexibility."
      },
      {
        "metric": "Cost reduction (annualized benefits)",
        "target": "$110-140M by end FY27",
        "period": "FY2026-FY2027",
        "vs_prior": "expanded program",
        "notes": "Expanded SPK-26 Operate Programme. Delivered $85M reduction in H2 FY25 vs H2 FY24. FY26 targeting $30-50M net labour cost reduction."
      },
      {
        "metric": "Capital expenditure",
        "target": "10-12% of revenue (long-run target)",
        "period": "Long-term",
        "vs_prior": "maintained",
        "notes": "FY25 capex was $429M (11.6% of revenue), down 17.2% YoY. Excludes spectrum and strategic capex (e.g., data centres)."
      }
    ],
    "management_commentary": "CEO Jolie Hodson emphasized transformation progress with cost base reset, portfolio simplification, and renewed focus on core connectivity. Chair Justine Smyth noted new SPK-30 strategy aims to deliver 'stable annuity-like returns' with sustainable FCF funding growing dividend over time. Management acknowledged performance below expectations but highlighted stabilizing trends in Q4 FY25 and momentum building into FY26."
  },
  "bull_case": [
    "Market leader position (#1 mobile 42% share, #1 broadband) with best network quality provides pricing power as market stabilizes",
    "Cost reduction program delivering $110-140M annualised savings by FY27, with $85M already achieved in H2 FY25, significantly improving margins",
    "Data centre business partnership with PEP unlocks value ($705M valuation) while retaining 25% upside in high-growth segment (118MW+ development pipeline)",
    "NZ economic recovery underway with RBNZ cutting rates aggressively (now 2.25%), unemployment peaking Q1 2026, should drive enterprise spending and consumer demand recovery",
    "AI and automation leadership in NZ market driving operational efficiency and new revenue opportunities (SparkGPT, network automation, customer service AI)",
    "IoT business growing rapidly (2.37M devices, +16% connections) provides new growth vector beyond saturated mobile/broadband",
    "Asset-light model post data centre sale and strategic partnerships (Nokia, Infosys, HPE) improves capital efficiency and ROIC (8.7% in FY25 vs cost of capital)",
    "Attractive dividend yield with new policy providing transparency (100% FCF payout FY26), supported by improved cash generation"
  ],
  "bear_case": [
    "Core mobile revenue declining (down 2.3% FY25) with structural pressure from competition, saturation, and enterprise workforce reductions - no clear path to revenue growth",
    "Profitability collapse with adjusted NPAT down 33.6% in FY25 and EBITDAI down 8.9%, reflecting structural margin pressure beyond cyclical factors",
    "Massive organizational disruption (1,300 FTE cut, engagement plummeted 67% to 50%) creates execution risk and potential service quality degradation",
    "Technology outsourcing to Nokia/Infosys/HPE introduces dependency risks and potential loss of competitive differentiation in core network operations",
    "Small NZ domestic market (~5M population) provides limited growth runway and no geographic diversification to offset local weakness",
    "Dividend cut from prior 25 cents per share with new policy potentially delivering less (70-100% of $290-330M FCF = ~15.4-17.5 cents per 1.89B shares)",
    "Enterprise and Government segment facing structural decline (IT services -7.7%, managed networks -9.9%) as customers shift to cloud/offshore providers",
    "Balance sheet stretched at 2.3x net debt/EBITDAI despite asset sales, limiting financial flexibility for growth investments or M&A",
    "Regulatory uncertainty with government review of telecom sector and Commerce Commission fibre regulation changes potentially impacting economics"
  ]
}
